SH6_58mps/system/controlDict
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     sonicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.6;

deltaT          0.000175;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression    off;

timeFormat      general;

timePrecision   6;

runTimeModifiable   true;

functions
{
    rhofunc
    {
        type                writeRegisteredObject;
        functionObjectLibs  ("libIOFunctionObjects.so");
        outputControl       outputTime;
        outputInterval      1;
        objectNames
        (
            "rho"
            "phi"
        );
    }

//    forces_elbowWall
//    {
//        type                forces;
//        functionObjectLibs  ("libforces.so");
//        outputControl       timeStep;
//        outputInterval      1;
//        patches             (elbowWall);
//        //directForceDensity  yes;
//        pName               p;
//        UName               U;
//        rhoName             rhoInf;
//        rhoInf              50.47;
//        // fDName              rho;
//        log                 true;
//        CofR                (0 0 0);
//    }
}

