SH6_58mps/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13800
(
(57.9 0 0)
(57.9 0 0)
(57.9 0 0)
(57.9 0 0)
(57.9 0 0)
(57.9 0 0)
(57.9 0 0)
(57.9 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (57.9 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            empty;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
